app/Controllers/Home.php

        public function getsections()
        {
            try {
                $builder = $this->db->table('tbl_register')
                    ->select('tbl_register.id as con_id, tbl_register.degree, tbl_register.role, tbl_register.name, tbl_register.section,tbl_register.mobile,tbl_register.password, tbl_section.section_name') // Selecting the section_name
                    ->join('tbl_section', 'tbl_section.id = tbl_register.section', 'left') // Join to get section_name
                    ->where('tbl_register.is_deleted', 'N')
                    ->where('tbl_register.role', 'Consultant');
---
SELECT "tbl_register".*, "tbl_section"."section_name"
FROM "tbl_register"
LEFT JOIN "tbl_section" ON "tbl_section"."id" = "tbl_register"."section"
WHERE "tbl_register"."is_deleted" = 'N'
AND   (
"tbl_register"."role" = 'Employee'
OR "tbl_register"."role" = 'Admin'
 )